Revit 2027 API
KeyBasedTreeEntriesLoadContent.IsEntriesBuilt Method
 Verifies that the KeyBasedTreeEntries object owned by a KeyBasedTreeEntriesLoadContent object is built.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsEntriesBuilt(
	KeyBasedTreeEntriesLoadContent content
)
Public Shared Function IsEntriesBuilt (
	content As KeyBasedTreeEntriesLoadContent
) As Boolean
public:
static bool IsEntriesBuilt(
	KeyBasedTreeEntriesLoadContent^ content
)
static member IsEntriesBuilt :
        content : KeyBasedTreeEntriesLoadContent -> bool
Parameters
content KeyBasedTreeEntriesLoadContent
 The KeyBasedTreeEntriesLoadContent object to be checked.
Return Value
Boolean
 True if the KeyBasedTreeEntries object is built already, otherwise false.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeyBasedTreeEntriesLoadContent Class
Autodesk.Revit.DB Namespace